INSERT INTO product (product_name, type, quantity, measure, expiration_date_from, expiration_date_to, storage_location) VALUES
('Asus Rog Strix', 'Ноутбуки', 5, 'штук', '2021-08-01 00:00:00', '2022-08-01 00:00:00', '02 10 03'),
('Xiaomi redmi note 8', 'Смартфоны', 10, 'штук', '2020-11-23 15:00:00', '2022-12-01 5:00:00', '03 03 04'),
('Samsung t-867', 'Компьютеры', 20, 'штук', '2020-12-29 20:30:00', '2022-07-05 16:30:00', '02 05 06'), 
('Стиральная машинка LG', 'Бытовая техника', 10, 'штук', '2021-01-22 10:30:00', '2022-06-28 12:32:00', '03 05 07'),
('Передний бампер', 'Детали', 6, 'штук', '2020-09-23 18:00:00', '2022-08-12 15:00:00', '05 04 03'),
('Комод', 'Мебель', 7, 'штук', '2021-02-10 19:30:00', '2022-05-10 19:30:00', '03 07 08'),
('Пылесос', 'Бытовая техника', 15, 'штук', '2021-01-19 17:50:00', '2022-11-29 17:50:00', '03 04 09'),
('Картошка', 'Овощи', 100, 'штук','2021-01-22 10:30:00', '2022-12-22 11:30:00', '01 01 05') 

INSERT INTO client (client_name, contact, address, email) VALUES
('Иван Иванов', '+7 (976) 130-93-80', 'Ярославское шоссе д26', 'cromaint0@go.com'),
('Василиса Угаройко', '+7 (975) 135-96-90', 'Мосфильмовская улица, д53', 'jcess1@mashable.com'),
('Джулий Владимир', '+7 (985) 935-86-00', 'улица Покровкаб д26', 'pbrew2@booking.com'),
('Багров Алексей', '+7 (965) 165-46-98', 'Остоженка 895', 'dflexman3@themeforest.net'),
('Дудаков Денис', '+7 (975) 665-46-86', 'Цветной бульвар, д11', 'tvickery4@behance.net'),
('Жуков Никита', '+7 (976) 105-03-13', 'Театральный пр-д, д5/1', 'bleban5@jiathis.com'),
('Жуков Никита', '+7 (975) 455-76-46', 'Тверская улица, д18к1', 'lpays6@tmall.com'),
('Чанкаев Шамиль', '+7 (963) 144-88-75', 'улица Солянка д1/2', 'bcapnor7@networksolutions.com')

INSERT INTO suppliers (supplier_name, contact, address, email) VALUES
('Казакова Алиса', '+7 (926) 059-17-93', 'улица Пятницкая, д27', 'wokker0@infoseek.co.jp'),
('Богданова Василиса', '+7 (926) 765-17-17', 'улица Арбат, д1', 'bsommer1@ezinearticles.com'),
('Худяков Лев', '+7 (926) 856-71-63', 'Цимлянская улица, д3', 'rmackaig2@drupal.org'),
('Касаткин Илья', '+7 (926) 012-05-22', 'Простоквашинский проезд, д41', 'psallenger3@prnewswire.com'),
('Григорьев Владислав', '+7 (926) 681-35-69', 'Улица Каменькин луг, д4', 'sbarribal4@hp.com'),
('Глухова Милана', '+7 (926) 796-84-22', 'Последний переулок, д3', 'cpegden5@skype.com'),
('Устинов Тимофей', '+7 (926) 796-94-32', 'Золотолиственная улица, д2', 'amarner6@nytimes.com'),
('Филиппов Андрей', '+7 (926) 120-55-22', 'Зимний переулок, д9', 'awrist7@cnet.com'),
('Литвинов Дмитрий', '+7 (926) 716-32-93', 'Кузнеческий проезд, д3', 'amatejic8@reverbnation.com'),
('Розанова Алиса', '+7 (926) 177-90-61', 'Черная улица, д13', 'ehuson9@weather.com')

INSERT INTO supplies (product_id, supplier_id, data_supply, count, status, store_period) VALUES
(1, 1, '2022-01-05 10:40:00', 5, 'в процессе', 120),
(3, 2, '2022-02-03 19:50:00', 5, 'в процессе', 100),
(2, 3, '2022-02-26 13:20:00', 5, 'в процессе', 60),
(5, 4, '2022-03-20 17:10:00', 5, 'в процессе', 90),
(6, 5, '2022-04-16 11:00:00', 5, 'в процессе', 80),
(4, 6, '2022-05-25 12:20:00', 5, 'в процессе', 120)


INSERT INTO deliveries (product_id, client_id, date_issue, count, status) VALUES
(1, 1, '2022-02-05 10:40:00', 6, 'завершен'),
(3, 2, '2022-01-03 19:50:00', 5, 'завершен'),
(2, 3, '2022-06-26 13:20:00', 4, 'в процессе'),
(5, 4, '2022-07-20 17:10:00', 9, 'в процессе'),
(6, 5, '2022-08-16 11:00:00', 2, 'в процессе'),
(4, 6, '2022-09-25 12:20:00', 1, 'в процессе')